import json

from PiktaNalog import PiktaNalog


def dump(value):
    print((json.dumps(value, indent=4, sort_keys=True, ensure_ascii=False)))


n = PiktaNalog()

ifns = "7840"
oktmmf = "40913000"
dump(n.get_info(ifns, oktmmf))


# console:
# {
#     "form": {
#         "ifns": "7840",
#         "npKind": "fl",
#         "oktmmf": "40913000",
#         "step": "1"
#     },
#     "ifnsDetails": {
#         "ifnsAddr": ",190103,Санкт-Петербург г,,,,Лермонтовский пр-кт,47литераА,,",
#         "ifnsCode": "7840",
#         "ifnsComment": "Код ОКПО:15168308 Прием: Понедельник, среда с 09.00 до 18.00.
#           Вторник, четверг с 09.00 до 20.00. Пятница с 09.00 до 16.45. Вторая и четвертая
#           субботы месяца с 10.00 до 15.00. Без перерыва на обед.",
#         "ifnsInn": "7841000026",
#         "ifnsKpp": "783901001",
#         "ifnsName": "Межрайонная инспекция Федеральной налоговой службы №9 по Санкт-Петербургу",
#         "ifnsPhone": "812-575-17-16",
#         "sprof": "78086",
#         "sprou": "78086"
#     },
#     "nextStep": 2,
#     "payeeDetails": {
#         "bankBic": "014030106",
#         "bankName": "СЕВЕРО-ЗАПАДНОЕ ГУ БАНКА РОССИИ//УФК по г.Санкт-Петербургу г. Санкт-Петербург",
#         "correspAcc": "40102810945370000005",
#         "payeeAcc": "03100643000000017200",
#         "payeeInn": "7841000026",
#         "payeeKpp": "783901001",
#         "payeeName": "Управление Федерального казначейства по г. Санкт-Петербургу (Межрайонная
#           инспекция Федеральной налоговой службы №9 по Санкт-Петербургу)"
#     },
#     "sprofDetails": {
#         "ifnsCode": "7847",
#         "sproAddr": ",191124, Санкт-Петербург г,,,, Красного Текстильщика ул, д 10-12 лит.О,,",
#         "sproCode": "78086",
#         "sproComment": "Прием: Понедельник, среда с 09.00 до 18.00. Вторник, четверг
#           с 09.00 до 20.00. Пятница с 09.00 до 16.45. Без перерыва на обед.",
#         "sproName": "Межрайонная ИФНС России №15 по Санкт-Петербургу",
#         "sproPhone": "812-335-14-03"
#     },
#     "sprouDetails": {
#         "ifnsCode": "7847",
#         "sproAddr": ",191124, Санкт-Петербург г,,,, Красного Текстильщика ул, д 10-12 лит.О,,",
#         "sproCode": "78086",
#         "sproComment": "Прием: Понедельник, среда с 09.00 до 18.00. Вторник, четверг
#           с 09.00 до 20.00. Пятница с 09.00 до 16.45. Без перерыва на обед.",
#         "sproName": "Межрайонная ИФНС России №15 по Санкт-Петербургу",
#         "sproPhone": "812-335-14-03"
#     },
#     "step": 1
# }
